<?php

use Spatie\LaravelSettings\Migrations\SettingsMigration;

return new class extends SettingsMigration {
    public function up(): void {

        $this->migrator->add('landing.content', [
            'header' => [
                'title' => 'جمالك يبدأ معنا!',
                'description' => 'تطبيق التجميل الأول في السعودية. خدمات متكاملة، ولاء يكافئك، وحجوزات تفاعلية سهلة',
            ],
            'about' => 'وجهتك المثالية للحصول على خدمات التجميل بكل سهولة وراحة! يوفر لك التطبيق مجموعة واسعة من الصالونات ومقدمي الخدمات المحترفين في جميع مجالات العناية والجمال. من تصفيف الشعر إلى العناية بالبشرة والأظافر، يمكنك تصفح الخدمات، مقارنة التقييمات، وحجز موعدك بكل سهولة.',
            'footer' => [
                'title' => 'مستعدة للتألق؟',
                'description' => 'ابدئي رحلتك الآن .. حمّلي التطبيق واحجزي بكل سهولة!'
            ],
            'features' => [
                ['title' => 'وفر وقتك وجهدك', 'description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
                ['title' => 'مقدمي خدمات محترفين', 'تعرف على مقدمي الخدمات واختر من بينهم','description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
                ['title' => 'حجوزات سهلة', 'احجزي موعدك بكل سهولة ويسر','description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
                ['title' => 'تقييمات وآراء', 'تعرفي على تقييمات العملاء وآرائهم','description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
                ['title' => 'عروض وخصومات', 'تعرفي على العروض والخصومات المتوفرة','description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
                ['title' => 'وفاء ومكافآت', 'احصلي على نقاط ومكافآت مع كل حجز','description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
                ['title' => 'تجربة مميزة', 'استمتعي بتجربة فريدة ومميزة','description' => 'حدد موقعك على الخريطة تجد مقدمي الخدمات الأقرب إليك بكل سهولة'],
            ]

        ]);
        $this->migrator->add('landing.features', []);
    }
};
